webProject/rubyApp/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:sessions][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "jaredrickert52@gmail.com"]]