webProject/rubyApp/app/controllers/users_controller.rb

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "phone_number", "subscribed", "password_digest", "created_at", "updated_at", "remember_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes user_params
---
UPDATE "users" SET "phone_number" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["phone_number", "f"], ["password_digest", "$2a$10$RjyMaTD7Rg8/OSYbK2am6u.1tou7j57wyRy1fv.iEOpGE4QWJVBH6"], ["updated_at", "2016-04-09 10:08:58.987485"], ["id", 2]]